{
  "meta": {
    "pages": [
      "page1.png"
    ]
  },
  "points": [
    {
      "id": "sparks",
      "name": "Loose Sparks of Power",
      "start": 7
    }
  ],
  "groups": [
    {
      "id": "intro_group",
      "title": "Introduction",
      "coords": {
        "x": 25,
        "y": 408,
        "w": 1855,
        "h": 462
      },
      "description": "Arise, Sire! Your time has come!\nBy means unknown, you have risen to the grand position of Dark Lord.\nYour goal is to conquer and corrupt, to extend your influence over all that you survey in defiance of any current rulers. You are not called to do so by any higher power or ancient geas. It is simply your nature. Malice runs in your veins, and cruelty has become your birthright.\nMuch of your power is committed to the essentials of your new role, but you retain a fraction of it to apportion as you please.\nEach section below will come with a number of free choices that you must use. You have 7 Loose Sparks of Power which you can use to purchase boons from any section, and must finish this document with zero (0) or more.\nThe following three boons are yours by default.\nLONG MAY YOU REIGN.",
      "items": []
    },
    {
      "id": "default_boons",
      "title": "Default Boons",
      "description": "These powers are inherent to your nature as a Dark Lord.",
      "coords": {
        "x": 25,
        "y": 890,
        "w": 1855,
        "h": 615
      },
      "items": [
        {
          "id": "immortality",
          "title": "Immortality",
          "coords": {
            "x": 25,
            "y": 890,
            "w": 605,
            "h": 615
          },
          "description": "Evil never truly dies.\nAge and Illness have no power over you. If your mortal form is somehow slain, you will reform yourself some time within the next 100 years. If your spirit is sealed away, you will be freed within 1000 years.\nIf you are banished from a world, you will be reborn on another within 50 years.",
          "cost": []
        },
        {
          "id": "corruption",
          "title": "Corruption",
          "coords": {
            "x": 650,
            "y": 890,
            "w": 605,
            "h": 615
          },
          "description": "Bend all to your will.\nBy establishing dominance over a person, place, or thing you can magically bend it to your will.\nHoly weapons become perverted to darkness, brave heroes become slaves to your will, and even the land itself twists to suit your needs... if you can break down your target's resistance, that is.",
          "cost": []
        },
        {
          "id": "expansion",
          "title": "Expansion",
          "coords": {
            "x": 1275,
            "y": 890,
            "w": 605,
            "h": 615
          },
          "description": "Nothing is beyond your reach.\nYour awakening coincides with you falling between worlds. Perhaps one caused the other, but you cannot say. You can use this CYOA in conjunction with any CYOA that takes you to a new world. You also gain access to a lengthy and expensive ritual to open permanent gateways to other worlds.",
          "cost": []
        }
      ]
    },
    {
      "id": "form",
      "title": "Form",
      "description": "Your physical body is unmade and remade by the dark powers in your veins. The exact cosmetics of your new form will be up to your discretion, but now is the time to decide the nature of your new existence. You have one (1) free Form choice. By purchasing a second one, you may choose to either blend your forms together to average their advantages and disadvantages or have the ability to switch between them. If you gain access to another CYOA-granted alteration of your form, you can choose to either discard that selection entirely or apply the benefits and drawbacks of Overpowering or Glamorous to it. You may not take Ephemeral with another body alteration in this way.",
      "coords": {
        "x": 25,
        "y": 1525,
        "w": 1855,
        "h": 300
      },
      "items": [
        {
          "id": "overpowering",
          "title": "Overpowering",
          "coords": {
            "x": 25,
            "y": 1845,
            "w": 605,
            "h": 610
          },
          "description": "You will be a juggernaut.\nYou focus on raw power. Your new form will be mighty beyond reckoning, possessing the speed, strength, and endurance of ten men. Your skin will turn many mortal weapons, and your senses will be as sharp as knives. Take care, as your sheer might will hint at your nature to all who see you.",
          "incompatible": [
            "ephemeral"
          ],
          "cost": [
            {
              "currency": "sparks",
              "value": 0,
              "condition": "isFree('form', 1) ? 0 : -1"
            }
          ]
        },
        {
          "id": "glamorous",
          "title": "Glamorous",
          "coords": {
            "x": 650,
            "y": 1845,
            "w": 605,
            "h": 610
          },
          "description": "You will be beautiful and perfect.\nYou focus on appeal and elegance. This will grant you preternatural beauty, open the ears of many to your words, and allow you to more readily conceal your nature when you venture out into the world. However, such guile has a cost. Your physical might will only be twice that of a mortal man's.",
          "incompatible": [
            "ephemeral"
          ],
          "cost": [
            {
              "currency": "sparks",
              "value": 0,
              "condition": "isFree('form', 1) ? 0 : -1"
            }
          ]
        },
        {
          "id": "ephemeral",
          "title": "Ephemeral",
          "coords": {
            "x": 1275,
            "y": 1845,
            "w": 605,
            "h": 610
          },
          "description": "Why form a body at all?\nYou become a shadow on the wall, a wisp of smoke on the wind. Such a formless being could only be slain by acts of great magic, and your stealth will be peerless... but exerting more than the faintest force will require focus, and your strength will compare unfavorably to stronger mortals.",
          "incompatible": [
            "overpowering",
            "glamorous"
          ],
          "cost": [
            {
              "currency": "sparks",
              "value": 0,
              "condition": "isFree('form', 1) ? 0 : -1"
            }
          ]
        }
      ]
    },
    {
      "id": "progeny",
      "title": "Progeny",
      "description": "As a Dark Lord- or Lady, I suppose, your choices are your own on that front- it is only to be expected that you will have a great brood of children through whatever methods you find appropriate. What is a Dark Lord without a harem of conquered princesses and heroines to lounge around your throne in chains, after all?\nBy default your magical nature allows you to breed with anything as long as one of you is getting seed in the other's womb, but the result of those unions is up to you to decide. You have ONE (1) free Progeny choice from the options below. If you purchase another, you are able to decide what percentage of your children will be of each type you purchased, and will know dark rituals to shape individual pregnancies to your will.",
      "coords": {
        "x": 25,
        "y": 2475,
        "w": 1855,
        "h": 300
      },
      "items": [
        {
          "id": "monsters",
          "title": "Monsters",
          "coords": {
            "x": 25,
            "y": 2795,
            "w": 605,
            "h": 615
          },
          "description": "Alas, your unfortunate offspring! Your Dark powers produce monstrous progeny with their very beings warped by the fell energies, their intellects to be crippled and their bodies deformed. Such progeny are undeniably mighty and remain unfailingly loyal to you, but their wretched existences lead to short lives. You gain one (1) Loose Spark of Power.",
          "cost": [
            {
              "currency": "sparks",
              "value": 1,
              "condition": "isFree('progeny', 1) ? 0 : -1" 
            }
          ]
        },
        {
          "id": "minions",
          "title": "Minions",
          "coords": {
            "x": 650,
            "y": 2795,
            "w": 605,
            "h": 615
          },
          "description": "Your children will be members of your horde, their exact race selected randomly from among the Minion choices available to you. Your direct offspring will tend to be well above average for their species, though they may also be more independent. You know dark rituals that allow you to influence which of the Minions available your children will become.",
          "cost": [
            {
              "currency": "sparks",
              "value": 0,
              "condition": "isFree('progeny', 1) ? 0 : -1"
            }
          ]
        },
        {
          "id": "masters",
          "title": "Masters",
          "coords": {
            "x": 1275,
            "y": 2795,
            "w": 605,
            "h": 615
          },
          "description": "These children are perhaps the most 'natural' kind, coming out with a mixture of their parents' traits. Their fragments of your own dark powers and the ability to command your minions in your stead make for fine lieutenants, but take care. For while they bear an instinctive loyalty to you... they also have shadows of your own darker nature. And instinct can be overridden.",
          "cost": [
            {
              "currency": "sparks",
              "value": 0,
              "condition": "isFree('progeny', 1) ? 0 : -1"
            }
          ]
        }
      ]
    },
    {
      "id": "lair",
      "title": "Lair",
      "description": "A being of your power and nature demands a seat for that power, a territory to call your own. Your Lair sits at the heart of your Domain, a fortress from which you can rule your lands with an iron fist. Your starting lair comes with a small cache of dark lore with which to research new expressions of your powers, the magical fonts from which your starting Minions are born, and a dungeon in which to house and break captives. Further details are decided below. You have one (1) free Lair choice from the options below. If you buy more than one, it is up to you to decide whether they should be melded together or distantly connected by hidden tunnels.",
      "coords": {
        "x": 25,
        "y": 3430,
        "w": 1855,
        "h": 290
      },
      "items": [
        {
          "id": "catacombs",
          "title": "Catacombs",
          "coords": {
            "x": 25,
            "y": 3740,
            "w": 605,
            "h": 620
          },
          "description": "A warren of tunnels and caverns and crevasses. Is your lair the catacombs of some great city, or a long-abandoned mine? Perhaps you have claimed and finished a natural cave formation, or even an old and forgotten dungeon in the wilderness. Only a bit cramped and extremely covert... as long as you stay inside. Of course, food will have to be acquired somehow...",
          "cost": [
            {
              "currency": "sparks",
              "value": 0,
              "condition": "isFree('lair', 1) ? 0 : -1"
            }
          ]
        },
        {
          "id": "tower",
          "title": "Tower",
          "coords": {
            "x": 650,
            "y": 3740,
            "w": 605,
            "h": 620
          },
          "description": "Akin to a foreboding tower on a lonely mountaintop, befitting a master wizard. Deeply secluded, with a good swathe of terrain at its command... but somewhat inconvenient to move to and from, and food supply will be an issue you need to address early. This choice includes a large cache of useful lore, granting a 50% boost to Research speed for your first 12 points.",
          "cost": [
            {
              "currency": "sparks",
              "value": 0,
              "condition": "isFree('lair', 1) ? 0 : -1"
            }
          ]
        },
        {
          "id": "castle",
          "title": "Castle",
          "coords": {
            "x": 1275,
            "y": 3740,
            "w": 605,
            "h": 620
          },
          "description": "A dark fortress commanding a large chunk of territory of your choosing. Do you want blasted plains, haunted forests, or icy peaks? Perhaps an abandoned, damned city is more to your liking? The region will be inhabited only sparsely by intelligent beings, and somewhat more thickly by wild monsters. You will have plenty of room to expand, though it is less than subtle.",
          "cost": [
            {
              "currency": "sparks",
              "value": 0,
              "condition": "isFree('lair', 1) ? 0 : -1"
            }
          ]
        },
        {
          "id": "manor",
          "title": "Manor",
          "coords": {
            "x": 25,
            "y": 4380,
            "w": 605,
            "h": 620
          },
          "description": "A prestigious, foreboding estate. It may be in the heart of a major city, or it may be somewhat more... secluded, but either way your lair will scream of flaunted wealth and an austere disposition. An excellent place from which to begin worming your way into high society... but a highly visible and ill-defensible one. Your Minions will need to be very, very careful.",
          "cost": [
            {
              "currency": "sparks",
              "value": 0,
              "condition": "isFree('lair', 1) ? 0 : -1"
            }
          ]
        },
        {
          "id": "dread_vessel",
          "title": "Dread Vessel",
          "coords": {
            "x": 650,
            "y": 4380,
            "w": 605,
            "h": 620
          },
          "description": "A ghost ship, a flying castle, perhaps even a space hulk. Whether it sails the seas, skies, or stars will depend on the world you journey to. Your vessel will be a massive and imposing one by the local standards, able to command the local terrain decisively. The advantages of mobility are of course countless, though expansion will eventually require ship-building.",
          "cost": [
            {
              "currency": "sparks",
              "value": 0,
              "condition": "isFree('lair', 1) ? 0 : -1"
            }
          ]
        },
        {
          "id": "underworld",
          "title": "Underworld",
          "coords": {
            "x": 1275,
            "y": 4380,
            "w": 605,
            "h": 620
          },
          "description": "A small demiplane of your very own, accessed through magical doorways you can open on any flat surface. Small runestones can be made to allow minions to come and go on their missions without your direct management, but be warned- anyone can use them. Eminently defensible and flexible but also the smallest option, and demiplanes are difficult to expand.",
          "cost": [
            {
              "currency": "sparks",
              "value": 0,
              "condition": "isFree('lair', 1) ? 0 : -1"
            }
          ]
        }
      ]
    }
  ]
}